list_ = ['BMW', 'MB', 'LADA', 'KIA', 'HONDA']
for i in list_:
    print('я езжу на автомобиле ' + i)
cars_count_ = 0
for j in range(0, 100, 10):
     print(j)
     # 3.Создайте целочисленную переменную cars_count = 0
     # 4.Напишите в цикле из шага номер 2 увеличение переменной на 10 в каждом шаге цикла (cars_count += 10)
     #  я не понял вопрос